backend/app/controllers/find_controller.rb

    def find
    ### 1) Find user portfolio and corresponding stocks
       portfolio =  Portfolio.find_by(user_id: params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]