backend/app/controllers/login_controller.rb

    def login
        user = User.find_by(email_address: params[:email_address])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "admin"], ["LIMIT", 1]]