backend/app/controllers/api/v1/transactions_controller.rb

    def index
        trans = Transaction.all
---
SELECT "transactions".* FROM "transactions"

    def create
        ## first find the stock

        user = User.find(params[:user_id])


        query = params[:ticker].capitalize()
        url = "https://cloud.iexapis.com/stable/stock/#{query}/quote?token=#{Rails.application.credentials[:apiKey]}&filter=companyName,symbol,latestPrice,previousClose"
        response = HTTParty.get("#{url}")

        if (response.body === "Unknown symbol")
            render json: {error: "Invalid Ticker"}
        end

            json = JSON.parse response.body

            userBalance = user.balance.to_f.round(2)
            totalCost = (json["latestPrice"].to_f().round(2) * params[:quantity].to_i())



            if(totalCost > userBalance )

                render json: {error: "you dont have enough funds "}
                puts "nope"
         else


                  user.update(balance: user.balance - totalCost )
                    newTransaction = user.transactions.create(ticker: "#{json["symbol"]}", quantity: params[:quantity].to_i, price: "#{json["latestPrice"]}")
---
INSERT INTO "transactions" ("ticker", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ticker", ""], ["user_id", 1], ["created_at", "2020-03-10 15:02:58.906049"], ["updated_at", "2020-03-10 15:02:58.906049"]]