backend/app/controllers/api/v1/transactions_controller.rb

    def create
        ### 1) find the user through params sent from front end
        user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

                 else
                    ### otherwise, create a new stock and add it to the user's portfolio of stocks
                    newStock = Stock.new(ticker: "#{json["symbol"]}", price: "#{json["latestPrice"]}", quantity: params[:quantity].to_i(), color: "gray")
                    portfolioStocks.push(newStock)
---
INSERT INTO "portfolios" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-03-10 19:18:44.960454"], ["updated_at", "2020-03-10 19:18:44.960454"]]
UPDATE "portfolios" SET "stocks" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3
INSERT INTO "stocks" ("ticker", "price", "quantity", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticker", "GOOGL"], ["price", "1275.68"], ["quantity", 1], ["color", "gray"], ["created_at", "2020-03-10 20:01:47.789577"], ["updated_at", "2020-03-10 20:01:47.789577"]]

                    ### Update user's portfolio and balance. Create a new transaction and send back to front end.


                  portfolio.update(stocks: portfolioStocks)
                  user.update(balance: user.balance - totalCost )
                  newTransaction = user.transactions.create(ticker: "#{json["symbol"]}", quantity: params[:quantity].to_i, price: "#{json["latestPrice"]}")
---
UPDATE "portfolios" SET "stocks" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", "3724.32"], ["updated_at", "2020-03-10 20:01:47.834343"], ["id", 1]]
INSERT INTO "users" ("name", "email_address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "transactions" ("ticker", "quantity", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticker", "GOOGL"], ["quantity", 1], ["price", "1275.68"], ["user_id", 1], ["created_at", "2020-03-10 20:01:47.894207"], ["updated_at", "2020-03-10 20:01:47.894207"]]