backend/app/controllers/api/v1/users_controller.rb

    def create

        user = User.new(
            email_address: params[:email_address],
            password: params[:password],
            name: params[:name],
            )

        if user.save
            Portfolio.create(user_id: user.id)
---
INSERT INTO "users" ("name", "email_address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "portfolios" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2020-03-11 02:02:11.926849"], ["updated_at", "2020-03-11 02:02:11.926849"]]